{
  "backend/main.mo": "Motoko backend implementing authorization plus user profiles, posts, comments, reactions, and reports with CRUD-style query/update methods.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to source files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "List of frontend file summaries describing UI components, pages, hooks, and styling used in the app.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables, light/dark themes, and global element styling.",
  "frontend/index.html": "Basic HTML shell loading the root React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up routing, theme provider, and global UI wrapper for feed, create, post detail, and guidelines pages.",
  "frontend/src/components/auth/LoginButton.tsx": "Sign‑in/out button using Internet Identity with loading states and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting authenticated first-time users to set a display name and save their profile.",
  "frontend/src/components/branding/HeroBanner.tsx": "Hero banner with app branding, description, and optional hero image for the feed page.",
  "frontend/src/components/comments/CommentComposer.tsx": "Provides a form to create comments or replies, handling submission state and success callbacks.",
  "frontend/src/components/comments/CommentThread.tsx": "Renders a comment with author info, reactions like reporting, and displays or composes replies.",
  "frontend/src/components/feed/FeedControls.tsx": "Adds UI controls for filtering posts by type and searching, with an option to clear active filters.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main layout with header navigation, mobile menu, profile setup dialog, and content outlet.",
  "frontend/src/components/posts/PostCard.tsx": "Shows a post preview with tags, author, timestamp, and navigation to the detailed post view.",
  "frontend/src/components/posts/TagsInput.tsx": "Manages interactive tag entry with validation, adding, removing, and limiting to five tags.",
  "frontend/src/components/reactions/ReactionBar.tsx": "Displays and toggles support/helpful reactions for a post with authentication checks.",
  "frontend/src/components/report/ReportDialog.tsx": "Provides a dialog for reporting posts or comments, handling authentication and submission state.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useComments.ts": "Provides hooks to fetch comments and replies and to create new comments with query invalidation.",
  "frontend/src/hooks/useCreatePost.ts": "Mutation hook for creating posts and invalidating the posts list.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches and updates the caller's user profile with proper loading and invalidation handling.",
  "frontend/src/hooks/useCurrentUserRole.ts": "Fetches the current user's role from the backend.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, login/logout handling, and identity persistence.",
  "frontend/src/hooks/usePostDetail.ts": "Fetches a single post by ID using the backend actor.",
  "frontend/src/hooks/usePosts.ts": "Retrieves posts based on filters or search keywords via backend queries.",
  "frontend/src/hooks/useQueries.ts": "Fetches community guidelines text from the backend.",
  "frontend/src/hooks/useReactions.ts": "Handles fetching reaction counts and toggling user reactions with optimistic updates.",
  "frontend/src/hooks/useReportContent.ts": "Mutation hook for reporting posts or comments to the backend.",
  "frontend/src/hooks/useUserProfile.ts": "Fetches a specific user's profile by principal ID.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the app with React, Internet Identity provider, and React Query client.",
  "frontend/src/pages/CommunityGuidelinesPage.tsx": "Renders the community guidelines page with static rules and fetched backend guidelines.",
  "frontend/src/pages/CreatePostPage.tsx": "React page that lets authenticated users create a question or story with title, body, and tags, redirecting to the new post after submission and prompting unauthenticated users to sign in.",
  "frontend/src/pages/FeedPage.tsx": "Main community feed displaying posts with filtering and search, plus controls to navigate to post creation and handle loading or error states.",
  "frontend/src/pages/PostDetailPage.tsx": "Shows full post details, author info, reactions, reporting, and threaded comments, handling loading, error, and navigation back to the feed.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, storing and retrieving them from sessionStorage, and managing persisted or hash-based params.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, typography, layout, and animations for the app's visual design.",
  "project_state.json": "Project state metadata describing features, requirements, versions, and asset expectations for the community support app."
}